
nc: 80
depth_multiple: 0.33
width_multiple: 0.50

backbone:
  - [-1, 1, DynamicConv, [64, 3, 2]]
  - [-1, 1, DynamicConv, [128, 3, 2]]
  - [-1, 3, C2f_Bifocal, [128]]
  - [-1, 1, DynamicConv, [256, 3, 2]]
  - [-1, 6, C2f_Bifocal, [256]]
  - [-1, 1, DynamicConv, [512, 3, 2]]
  - [-1, 6, C2f_Bifocal, [512]]
  - [-1, 1, DynamicConv, [1024, 3, 2]]
  - [-1, 3, C2f_Bifocal, [1024]]
  - [-1, 1, DK_FMM, [2, 3]]

head:
  - [9, 1, DynamicConv, [1024, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [6, 1, DynamicConv, [1024, 1, 1]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, C2f_DynamicConv, [512]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [4, 1, DynamicConv, [512, 1, 1]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, C2f_DynamicConv, [256]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [2, 1, DynamicConv, [256, 1, 1]]
  - [[-1, 19], 1, Concat, [1]]
  - [-1, 3, C2f_DynamicConv, [128]]

  - [22, 1, DynamicConv, [128, 3, 2]]
  - [[18, 4, -1], 1, Concat, [1]]
  - [-1, 3, C2f_DynamicConv, [256]]
  - [25, 1, DynamicConv, [256, 3, 2]]
  - [[14, 6, -1], 1, Concat, [1]]
  - [-1, 3, C2f_DynamicConv, [512]]
  - [28, 1, DynamicConv, [512, 3, 2]]
  - [[10, 9, -1], 1, Concat, [1]]
  - [-1, 3, C2f_DynamicConv, [1024]]

  - [22, 1, iRMB_Zoom, [128, 128]]
  - [-1, 1, SSEM, []]
  - [25, 1, iRMB_Zoom, [256, 256]]
  - [-1, 1, SSEM, []]
  - [28, 1, iRMB_Zoom, [512, 512]]
  - [-1, 1, SSEM, []]
  - [31, 1, iRMB_Zoom, [1024, 1024]]
  - [-1, 1, SSEM, []]

  - [[33, 35, 37, 39], 1, Detect, [nc]]
